InformationRegisters/СтатусОтправкиУКЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СтатусОтправкиУКЗ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументУчетаУКЗ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Производство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусОтправкиУКЗ/Ext/RecordSetModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Соответствие") Тогда
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			СтрокаНабора.ДокументУчетаУКЗ = ДанныеЗаполнения.Получить("ДокументУчетаУКЗ");
			СтрокаНабора.Период = ДанныеЗаполнения.Получить("Период");
			СтрокаНабора.Статус = ДанныеЗаполнения.Получить("Статус");
			СтрокаНабора.КодОтвета = ДанныеЗаполнения.Получить("КодОтвета");
			СтрокаНабора.ТекстОтвета = ДанныеЗаполнения.Получить("ТекстОтвета");
			СтрокаНабора.ИдентификаторОтчета = ДанныеЗаполнения.Получить("ИдентификаторОтчета");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
